Repository: samuelpmvm/weather-app
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: pt_pt

source: Current weather in {city}:
pt_pt: Tempo atual em {city}:

source: Temperature: {temp}°C (min: {temp_min}°C, max: {temp_max}°C)
pt_pt: Temperatura: {temp}°C (mín: {temp_min}°C, máx: {temp_max}°C)

source: Description: {desc}
pt_pt: Descrição: {desc}

source: Humidity: {humidity}%
pt_pt: Humidade: {humidity}%

source: Pressure: {pressure} hPa
pt_pt: Pressão: {pressure} hPa

source: Wind: {wind_speed} m/s, {wind_deg}°
pt_pt: Vento: {wind_speed} m/s, {wind_deg}°

source: Could not retrieve weather data.
pt_pt: Não foi possível obter os dados do tempo.

source: Weather forecast for {city}:
pt_pt: Previsão do tempo para {city}:

source: {dt_txt}: {temp}°C, {desc}, Humidity: {humidity}%, Wind: {wind_speed} m/s
pt_pt: {dt_txt}: {temp}°C, {desc}, Humidade: {humidity}%, Vento: {wind_speed} m/s

source: Could not retrieve forecast data.
pt_pt: Não foi possível obter a previsão do tempo.
